# StairsStringerCannotBeCreated Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..StairsStringerCannotBeCreated Property
BuiltInFailures..::..StairRampFailures Class See Also
---
The stairs stringer cannot be created.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StairsStringerCannotBeCreated { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsStringerCannotBeCreated As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StairsStringerCannotBeCreated {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace